[{"date":"20 June, 2023","subtitle":"Encryption for APIs is crucial to protect sensitive data, comply with regulations, build trust, mitigate risks, and maintain a strong competitive position in today\u0026rsquo;s security-conscious environment. It safeguards your users\u0026rsquo; information, preserves your reputation, and positions your API as a secure and reliable service.","tags":"api programming devops python development microservices security","title":"Encryption for Apis","url":"/posts/encryption-for-apis/"},{"date":"19 June, 2023","subtitle":"In this article i would like to peek in few of the top interview questions covering DevOps principles, continuous integration, deployment strategies, infrastructure automation, and more to enhance your chances of landing that dream DevOps role.","tags":"git devops interview questions","title":"Essential Questions to Ace Your Next DevOps Job Interview","url":"/posts/devops-interview-questions/"},{"date":"15 June, 2023","subtitle":"The two terms often used in tandem for access control in almost every system but they are inherently different. In this article i  will try to explain difference between these two terms.","tags":"api programming devops python development microservices security","title":"API Authentication and Authroization","url":"/posts/api-authentication-vs-authorization/"},{"date":"1 June, 2023","subtitle":"Building secure APIs is crucial to protect sensitive data, maintain user trust, and safeguard against cyber threats, ensuring the integrity and reputation of organizations in today\u0026rsquo;s interconnected digital landscape.","tags":"api programming devops python development microservices security","title":"Building Secure Apis Safeguarding Data and Trust","url":"/posts/building-secure-apis-safeguarding-data-and-trust/"},{"date":"29 May, 2023","subtitle":"In this series of article i would be explaining what is an API and what are the uses. How is it useful and what are the types of APIs. In other  parts of the series i would be discussing other aspects of API such as authenication and authorization, securing API, data validation, rate limiting and throttling, error handling and logging, secure storage solutions, least previlages prinicples, security testing, regular updates and patching and api documentation and education.","tags":"api programming devops python development microservices security","title":"Unsung Heros of Interconnected world - APIs","url":"/posts/api/"},{"date":"29 April, 2023","subtitle":"Jupyter Notebook is a popular choice among data scientist and data engineer developing application. There are numerous factors of why Jupyter Notebooks are preferred choice for getting up and running quickly. There are several posts why they do so. This article on real python nicely explains.\nHere i would be describing how to install Jupyter Notebook in a personal laptop and getting up and running quickly. If you aren\u0026rsquo;t familiar with virtual env or venv, you can refer to this post.","tags":"data-science python python3.10 virtualenv venv jupyter notebook","title":"Installing Jupyter Notebook in virtual env","url":"/posts/installing-jupyter-notebook-with-virtualenv/"},{"date":"6 November, 2022","subtitle":"This post is third and final part of the series where i am demostrating to setup automated remote state management of our notes. Before continuing here, i would recommend to go through part-1 and part-2 of the sereis.\nService and TimerCreate a systemd service and a timer . The function of timer unit is to trigger service unit and the service unit will execute the obsidian-sync script\nTimer UnitCreate a timer obsidian-sync.","tags":"linux guide","title":"Obsidian Sync as service","url":"/posts/obsidian-sync-part3/"},{"date":"5 November, 2022","subtitle":"This is the second part of three part post series. Be sure to checkout part-1 before continuing here.\nIn this post I am going to create a script which does only one thing: Take all uncommitted changes and pushes them to remote repository. In next part of the series we will create a systemd service and systemd timer to timely execute this script.\nHigh level planThere are three parts to achieve successful state.","tags":"linux guide","title":"Obsidian Sync script","url":"/posts/obsidian-sync-part2/"},{"date":"12 September, 2022","subtitle":"Obsidian-sync is a three part series describing a setup for automated push to remote git repository. Although the subject is obsidian automated push to remote repository, it can be applied, in general, to any other place where automated push may be required.\nWhat is ObsidianObsidian is a note-taking app with a focus on privacy and flexibility. All your notes live on your machine (or wherever you choose to sync them to).","tags":"linux guide","title":"Obsidian Sync","url":"/posts/obsidian-sync/"},{"date":"11 September, 2022","subtitle":"Confused and Puzzeled how and where to get started?\nNo, you are not alone. It is totally natural to get overwhalmed with so many services offered by AWS. Here, i aim to provide just enough information to get started. AWS, or Amazon Web Services does not need any introduction. It is market leader and 80% of cloud workload is on AWS.\nSometime, i wonder there should be a guide of simple steps that should guide me just enough to get started with my AWS account.","tags":"documentation guide","title":"Getting Started With AWS","url":"/posts/getting-started-with-aws/"},{"date":"9 August, 2022","subtitle":"\u003cp\u003ePuppet is a responsive, simple and clean \u003ca href=\"https://gohugo.io/\"\u003eHugo\u003c/a\u003e theme based on the \u003ca href=\"https://github.com/Huxpro/huxpro.github.io\"\u003eHuxblog Jekyll theme\u003c/a\u003e.\u003c/p\u003e","tags":"documentation guide","title":"Puppet - Getting Started","url":"/posts/getting-started/"},{"date":"11 March, 2020","subtitle":"\u003cp\u003eThis article offers a sample of basic Markdown syntax that can be used in Hugo content files, also it shows whether basic HTML elements are decorated with CSS in a Hugo theme.\u003c/p\u003e","tags":"markdown css html","title":"Markdown Syntax Guide","url":"/posts/markdown-syntax/"},{"date":"10 March, 2019","subtitle":"A brief description of Hugo Shortcodes","tags":"shortcodes privacy MarkDown","title":"Rich Content","url":"/posts/rich-content/"},{"date":"9 March, 2019","subtitle":"\u003cp\u003eLorem est tota propiore conpellat pectoribus de pectora summo.\u003c/p\u003e","tags":"markdown text","title":"Placeholder Text","url":"/posts/placeholder-text/"},{"date":"8 March, 2019","subtitle":"\u003cp\u003eMathematical notation in a Hugo project can be enabled by using third party JavaScript libraries.\u003c/p\u003e","tags":"","title":"Math Typesetting","url":"/posts/math-typesetting/"},{"date":"5 March, 2019","subtitle":"\u003cp\u003eEmoji can be enabled in a Hugo project in a number of ways.\u003c/p\u003e","tags":"emoji","title":"Emoji Support","url":"/posts/emoji-support/"}]